###################################################################

# Created by write_sdc on Tue Feb 28 14:25:23 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_delay 25  -to [get_ports {op[6]}]
set_max_delay 25  -to [get_ports {op[5]}]
set_max_delay 25  -to [get_ports {op[4]}]
set_max_delay 25  -to [get_ports {op[3]}]
set_max_delay 25  -to [get_ports {op[2]}]
set_max_delay 25  -to [get_ports {op[1]}]
set_max_delay 25  -to [get_ports {op[0]}]
set_load 0.00080009  [get_nets n25]
set_load 0.000958468  [get_nets n23]
set_load 0.00297876  [get_nets n18]
set_load 0.000401206  [get_nets n24]
set_load 0.00278721  [get_nets n9]
set_load 0.000708625  [get_nets n19]
set_load 0.00112162  [get_nets n2]
set_load 0.00134515  [get_nets n22]
set_load 0.000676021  [get_nets n7]
set_load 0.00120778  [get_nets n21]
set_load 0.00145264  [get_nets n6]
set_load 0.000671578  [get_nets n4]
set_load 0.00390057  [get_nets n10]
set_load 0.000950456  [get_nets n20]
set_load 0.000676434  [get_nets n5]
set_load 0.00150818  [get_nets n15]
set_load 0.00157263  [get_nets n8]
set_load 0.000648194  [get_nets n17]
set_load 0.00106856  [get_nets n16]
set_load 0.000932162  [get_nets n13]
set_load 0.000791448  [get_nets n14]
set_load 0.00136658  [get_nets n12]
set_load 0.0018727  [get_nets n11]
set_load 0.000542487  [get_nets n1]
set_load 0.000726708  [get_nets {op[6]}]
set_load 0.00155535  [get_nets {op[5]}]
set_load 0.00148083  [get_nets {op[4]}]
set_load 0.00120075  [get_nets {op[3]}]
set_load 0.00272395  [get_nets {op[2]}]
set_load 0.00158218  [get_nets {op[1]}]
set_load 0.00169406  [get_nets {op[0]}]
set_load 0.00180356  [get_nets {funct[5]}]
set_load 0.000570609  [get_nets {funct[4]}]
set_load 0.00142726  [get_nets {funct[3]}]
set_load 0.00327136  [get_nets {funct[2]}]
set_load 0.00312035  [get_nets {funct[1]}]
set_load 0.00161344  [get_nets {funct[0]}]
set_load 0.00458687  [get_nets {alu_op[1]}]
set_load 0.0038381  [get_nets {alu_op[0]}]
