###################################################################

# Created by write_sdc on Tue May  2 11:19:15 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_delay 25  -to [get_ports {alucontrol[6]}]
set_max_delay 25  -to [get_ports {alucontrol[5]}]
set_max_delay 25  -to [get_ports {alucontrol[4]}]
set_max_delay 25  -to [get_ports {alucontrol[3]}]
set_max_delay 25  -to [get_ports {alucontrol[2]}]
set_max_delay 25  -to [get_ports {alucontrol[1]}]
set_max_delay 25  -to [get_ports {alucontrol[0]}]
set_load 0.000756126  [get_nets n24]
set_load 0.000680561  [get_nets n17]
set_load 0.000387223  [get_nets n19]
set_load 0.000885186  [get_nets n4]
set_load 0.000307504  [get_nets n18]
set_load 0.000276216  [get_nets n14]
set_load 0.000568798  [get_nets n13]
set_load 0.000613935  [get_nets n7]
set_load 0.000503255  [get_nets n8]
set_load 0.000988001  [get_nets n32]
set_load 0.00231963  [get_nets n25]
set_load 0.00186761  [get_nets n15]
set_load 0.00127143  [get_nets n11]
set_load 0.00238724  [get_nets n21]
set_load 0.000670643  [get_nets n33]
set_load 0.00048949  [get_nets n34]
set_load 0.00194107  [get_nets n9]
set_load 0.00113712  [get_nets n16]
set_load 0.00136193  [get_nets n3]
set_load 0.00161  [get_nets n30]
set_load 0.000684207  [get_nets n2]
set_load 0.00221963  [get_nets n12]
set_load 0.00119791  [get_nets n20]
set_load 0.00330728  [get_nets n31]
set_load 0.000668029  [get_nets n6]
set_load 0.000811918  [get_nets n29]
set_load 0.00222148  [get_nets n28]
set_load 0.000633544  [get_nets n5]
set_load 0.00104101  [get_nets n10]
set_load 0.00103743  [get_nets n27]
set_load 0.0016685  [get_nets n26]
set_load 0.00103577  [get_nets n1]
set_load 0.000849674  [get_nets n22]
set_load 0.000476454  [get_nets n23]
set_load 0.000716162  [get_nets {alucontrol[6]}]
set_load 0.00264123  [get_nets {alucontrol[5]}]
set_load 0.000760216  [get_nets {alucontrol[4]}]
set_load 0.00146214  [get_nets {alucontrol[3]}]
set_load 0.00151934  [get_nets {alucontrol[2]}]
set_load 0.00118006  [get_nets {alucontrol[1]}]
set_load 0.00241086  [get_nets {alucontrol[0]}]
set_load 0.00204048  [get_nets {funct[5]}]
set_load 0.00107593  [get_nets {funct[4]}]
set_load 0.00126538  [get_nets {funct[3]}]
set_load 0.00490774  [get_nets {funct[2]}]
set_load 0.00499657  [get_nets {funct[1]}]
set_load 0.00444656  [get_nets {funct[0]}]
set_load 0.00508863  [get_nets {aluop[1]}]
set_load 0.00467393  [get_nets {aluop[0]}]
